def game (x, g):
    print (f'Ход игрока - {x} введите номер ячейки для хода \nХод игрока 1 - Х, игрока 2 - О')
    y = int (input('Ваш ход -'))
    #g[y-1] = 'X'
    match x:
        case 1: g[y-1] = 'X'
        case 2: g[y-1] = 'O'
    x = 2
    print (f'|{g[0]}|{g[1]}|{g[2]}|\n|{g[3]}|{g[4]}|{g[5]}|\n|{g[6]}|{g[7]}|{g[8]}|')
print ('Крестики-нолики, вариант в терминале')
g = [1,2,3,4,5,6,7,8,9]
gamer = 2 
print (f'|{g[0]}|{g[1]}|{g[2]}|\n|{g[3]}|{g[4]}|{g[5]}|\n|{g[6]}|{g[7]}|{g[8]}|')
game (gamer, g)